
<html>
    <head>
        <meta http-equiv="Content-Type" content="text/html; charset=utf-8">
        <title>
            Bomj
        </title>
    </head>
    <body background="images/Wood13_col.jpg">
    <?php
    echo 'Hellow Maksik';
    phpinfo();
    ?>
    <strong>Автор сие творения</strong>
    <a href="https://vk.com/cnekir">Тык</a>
    <center>
        <p><font color="white"><i>Какие красивые животные</i></font></p>
        <table>
            <tr><td><img src="images/Jaguar-spotted-muzzle-predator-big-cat-1065015.jpg"></td>
                <td><img src="images/2d5f967c2b42438.jpg"></td>
                <td><img src="images/koshki-b026189ad125.jpg"></td>
            </tr>
        <tr><td align="center"><font color="white">Ягуар</font></td>
            <td align="center"><font color="white">Тигр</font></td>
            <td align="center"><font color="white">Гепард</font></td>
        </tr>
        </table>
    </center>
    <font color="white">
    <strong><p>Классификация:</p></strong>
    <ul>
        <li>Домен: Эукариоты</li>
        <li>Царство: Животные</li>
        <li>Тип: Хордовые</li>
        <li>Класс: Млекопитающие</li>
        <li>Отряд: Хищные</li>
    </ul>
    <p>Характерным признаком хищных являются хорошо дифференцированные зубы, причем клыки всегда крупные, развитые. По одному коренному зубу с каждой стороны челюсти превращаются в так называемый хищный зуб, который имеет большие размеры и острый режущий край. С его помощью животные дробят кости и перерезают сухожилия. У всеядных животных хищные зубы выражены хуже. Существенные отличия заметны в челюстях ластоногих по сравнению с наземными хищными. Челюсти ластоногих имеют приспособления для удержания скользкой рыбы. У моржей имеются своеобразные видоизменения зубов – бивни, а у тюленей-крабоедов видоизменены коренные зубы.</p>
    <p>На черепе хищного животного хорошо различимы четко очерченная скуловая дуга и обширная височная впадина рядом с глазницей. Это места расположения мощных височных мышц для сильного укуса жертвы. Строение челюсти хищного таково, что движения в височно-челюстном суставе возможны только вверх и вниз, а не как при жевании из стороны в сторону.</p>
</font>
</body>
</html>